Repository: 1Maxnet1/lingot
Catalog: po/*.po
Languages: sk

source: Cannot open audio device '%s'. %s
sk: Nedá sa otvoriť zvukové zariadenie '%s'. %s

source: Cannot initialize hardware parameter structure.
sk: Nedá sa inicializovať štruktúra nastavenia hardvéru.

source: Cannot set access type.
sk: Nedá sa nastaviť typ prístupu.

source: Cannot set sample format.
sk: Nedá sa nastaviť formát vzoriek.

source: Cannot set sample rate.
sk: Nedá sa nastaviť vzorkovacia frekvencia.

source: Cannot set channel number.
sk: Nedá sa nastaviť počet kanálov.

source: Cannot set parameters.
sk: Nedajú sa nastaviť parametre.

source: Cannot prepare audio interface for use.
sk: Nedá sa pripraviť zvukové rozhranie.

source: Read from audio interface failed.
sk: Čítanie zo zvukového rozhrania zlyhalo.

source: Default Device
sk: Predvolené zaradenie

source: Missing connection with JACK audio server
sk: Chýba spojenie so zvukovým serverom JACK

source: Unable to connect to JACK server
sk: Nedá sa pripojiť sa k JACK serveru

source: No more JACK ports available
sk: Nie sú dostupné žiadne ďalšie porty systému JACK

source: Default Port
sk: Predvolený port

source: Cannot activate client
sk: Nedá sa aktivovať klient

source: No active capture ports
sk: Žiadne aktívne vstupné porty

source: Cannot connect input ports
sk: Nedajú sa pripojiť vstupné porty

source: Cannot connect to requested port '%s'
sk: Nedá sa pripojiť na požadovaný port %s

source: Error setting number of channels.
sk: Chyba pri nastavovaní počtu kanálov.

source: Error setting bits per sample.
sk: Chyba pri nastavovaní počtu bitov na vzorku.

source: Error setting DMA buffer size.
sk: Chyba pri nastavovaní vyrovnávacej pamäte DMA.

source: Error setting sample rate.
sk: Chyba pri nastavovaní vzorkovacej frekvencie.

source: Error creating PulseAudio client.
sk: Chyba pri vytváraní klienta PulseAudio.

source: Default Source
sk: Predvolený zdroj

source: B
sk: H

source: Default equal-tempered scale
sk: Predvolená rovnomerne temperovaná stupnica

source: The temporal buffer is smaller than FFT size. It has been increased to %0.3f seconds
sk: Interval pre analýzu je menší ako je veľkosť FFT. Preto bol zvýšený na %0.3f sekundy

source: You cannot insert before the reference note.
sk: Nedá sa vkladať pred základný (referenčný) tón.

source: Do not use space characters for the note names.
sk: Nepoužívajte medzery v názvoch tónov.

source: The name contains illegal characters.
sk: Názov obsahuje nepovolené znaky.

source: You cannot change the first shift, it must be 1/1.
sk: Nedá sa zmeniť posun základného tónu, musí byť 1/1.

source: The shift must be between 0 and 1200 cents, or between 1/1 and 2/1.
sk: Interval musí byť medzi 0 a 1200 centami alebo 1/1 a 2/1.

source: mid-A
sk: stredné A

source: mid-C
sk: stredné C

source: Name
sk: Názov

source: Shift
sk: Interval

source: Frequency [Hz]
sk: Frekvencia [Hz]

source: There are notes with the same name
sk: Sú definované tóny s rovnakým názvom

source: There are invalid values in the scale: the notes should be ordered by frequency / shift
sk: V stupnici sú definované neplatné hodnoty: tóny musia byť zoradené poďla frekvencie / intervalu

source: There are invalid values in the scale: all the notes should be in the same octave
sk: V stupnici sú neplatné hodnoty: všetky tóny musia byť v rovnakej oktáve

source: There are notes without name
sk: Sú definované tóny bez názvu

source: Open Scale File
sk: Otvoriť súbor so stupnicou

source: Scala files
sk: Súbory Scala

source: Note identifier, free text that will be displayed in the main window when tuning close to the given note. Don't use space characters here.
sk: Názov tónu - text, ktorý bude zobrazený v hlavnom okne, ak sa ladenie priblíži k tomuto tónu. Nevkladajte do názvov medzery.

source: Shift. You can define it as a deviation in cents from the reference note (the first one), or as a frequency ratio, like '3/2' or '5/4'. All the values must be between 0 and 1200 cents, or between 1/1 and 2/1 (i.e., all the notes must be in the same octave), and they must be well ordered.
sk: Interval. Môžte ho zadať ako posun v centoch od referenčného tónu (prvý tón stupnice) alebo ako pomer frekvencií, napr. '3/2' alebo '5/4'. Všetky hodnoty musia byť v rozmedzí od 0 do 1200 centov, resp. 1/1 a 2/1 (to znamená v rovnakej oktáve) a musia byť usporiadané vzostupne.

source: Frequency. You can enter here the absolute frequency for a given note as a reference, and all the other frequencies will shift according to the deviations specified in the 'Shift' column. You can either use an absolute numeric value or the keywords '%s' (261.625565 Hz) and '%s' (440 Hz). Those keywords are normally reserved for the 4th octave (try to assign frequencies only to the 4th octave).
sk: Frekvencia. Tu je možné zadať absolútnu hodnotu frekvencie príslušného tónu ako referenčnú a všetky ostatné frekvencie budú prepočítané podľa nastavených intervalov. Je možné zadať buď číselnú hodnotu alebo kľúčové slová '%s' (261,6255565 Hz) a '%s' (440 Hz).

source: Audio device identifier too long
sk: Identifikátor zvukového zariadenia je príliš dlhý

source: The provided scale contains wide gaps in frequency that increase the gauge range and produce a loss of visual accuracy. Consider providing scales with at least 12 tones, or with a maximum distance between adjacent notes below 200 cents.
sk: Definovaná stupnica má veľké intervaly medzi tónmi, čo bude mať za následok zväčšenie rozsahu mierky a tým pádom i zníženú presnosť vizualizácie. Zvážte použitie stupnice s aspoň 12 tónmi alebo s najväčším intervalom medzi susednými tónmi menším ako 200 centov.

source: lingot configuration
sk: nastavenia lingot

source: Default
sk: Predvolené nastavenia

source: Resets the built-in settings, without applying them.
sk: Obnoví predvolené hodnoty bez toho, aby boli tieto nastavenia použité.

source: Applies the current changes to the running tuner, but doesn't modify the configuration file. Any applied changes can be rolled back pressing Cancel.
sk: Použije aktuálne zmeny pre prebiehajúce ladenie, ale nezapíše ich do súboru s konfiguráciou. Všetky použité zmeny možno vrátiť stlačením tlačidla Zrušiť.

source: Applies the current changes and modifies the configuration file.
sk: Použije aktuálne zmeny a zapíše ich aj do súboru s konfiguráciou.

source: Rolls back all the previous applied changes and closes the configuration dialog.
sk: Vráti zmeny a zatvorí okno s konfiguráciou.

source: Audio system
sk: Zvukový systém

source: Audio device
sk: Zvukové zariadenie

source: Here you can pick the sound system.
sk: Tu si môžte vybrať zvukový systém.

source: Choose the audio device if you have more than one. If you are using JACK, you can also connect Lingot to a desired source with an external JACK control application.
sk: Vyberte zvukové zariadenie, ak máte viac ako jedno. Ak používate JACK, môžete tiež Lingot pripojiť k požadovanému zariadeniu pomocou niektorej z aplikácií pre ovládanie JACKu.

source: Select the audio source:
sk: Vyberte zdroj zvuku:

source: Audio input settings. Select here the audio source.
sk: Nastavenia pre audio vstup. Tu vyberte zdroj zvuku.

source: Capture
sk: Vstup

source: Calculation rate
sk: Frekvencia výpočtov

source: Minimum SNR
sk: Minimálny odstup signál/šum

source: Adjust the following refresh rates:
sk: Upraviť nasledujúce intervaly obnovovania:

source: Adjust the noise level:
sk: Upraviť úroveň šumu:

source: Minimum signal-to-noise ratio to consider the captured signal as something relevant. Try to keep this level low, and raise it if you experience problems in very noisy environments. This level is depicted in the spectrum area as a yellow dotted line.
sk: Minimálny odstup signálu a šumu pre posúdenie toho, či zachytený signál obsahuje niečo, čo treba analyzovať. Snažte sa zachovať toto nastavenie na nízkej úrovni a zvýšte ho vtedy, ak máte problémy vo veľmi hlučnom prostredí. Táto úroveň je v poli spektra označená prerušovanou žltou čiarou.

source: Number of calculations of the fundamental frequency per second.
sk: Počet výpočtov základnej frekvencie za sekundu.

source: Quick adjustments on the dynamic response and the signal levels.
sk: Rýchle úpravy dynamickej odozvy a úrovní signálu.

source: Adjustments
sk: Nastavenia

source: Temporal window
sk: Interval pre analýzu

source: This is the most recent amount of data considered for tuning. The longer it is, the more accuracy you can obtain, but also the dynamic response gets slower, regarding you are considering older parts of the signal. Also, if you raise this parameter, the computational cost increases. The size of the buffer, in samples (depending on the effective sample rate), must be greater than or equal to the FFT buffer size.
sk: Toto je posledný časový úsek braný do úvahy pre ladenie. Čím je dlhší, tým vyššiu presnosť je možné dosiahnuť, ale zároveň sa predĺži odozva, keďže sa bude vyhodnocovať starší signál. Zvýšením tejto hodnoty tiež stúpa výpočtová náročnosť. Táto hodnota musí byť rovnaká alebo väčšia ako vyrovnávacia pamäť FFT.

source: seconds
sk: s

source: samples
sk: vzoriek

source: FFT size
sk: Rozsah FFT

source: The FFT buffer gives Lingot a first look to the spectrum. Higher values can help Lingot to hook up the correct peak, but it&apos;s also computationally more expensive. Don&apos;t use high values here unless you need to tune high frequencies.
sk: Vyrovnávacia pamäť pre FFT umožňuje analyzovať spektrum. Vyššie hodnoty môžu pomôcť nájsť správnu špičku, ale zároveň sú oveľa viac náročnejšie na výkon. Nenastavujte vyššie hodnoty, ak zároveň nemáte zodpovedajúcu vysokú efektívnu vzorkovaciu frekvenciu.

source: The FFT buffer gives Lingot a first look to the spectrum. Higher values can help Lingot to hook up the correct peak, but it's also computationally more expensive. Don't use high values here unless you need to tune high frequencies.
sk: Vyrovnávacia pamäť pre FFT umožňuje analyzovať spektrum. Vyššie hodnoty môžu pomôcť nájsť správnu špičku, ale zároveň sú oveľa viac náročnejšie na výkon. Nenastavujte vyššie hodnoty, ak zároveň nemáte zodpovedajúcu vysokú efektívnu vzorkovaciu frekvenciu.

source: Optimize parameters automatically
sk: Parametre optimalizovať automaticky

source: Leave this option ON and Lingot will optimize some parameters for you.
sk: Nechajte túto možnosť zapnutú a Lingot za vás niektoré parametre nastaví automaticky.

source: Minimum note
sk: Najnižší tón

source: Maximum note
sk: Najvyšší tón

source: This is the lowest frequency you want to tune in this instrument. You can put here either a frequency or select a note from the popup list.
sk: Toto je najnižšia frekvencia, na ktorú chcete naladiť tento nástroj. Môžete sem zadať buď frekvenciu alebo vybrať notu z rozbaľovacej ponuky.

source: Instrument frequency range
sk: Rozsah frekvencie nástroja

source: Basic settings on the frequency finding algorithm. Come here to get better accuracy, frequency range or CPU usage.
sk: Základné nastavenia algoritmu pre zistenie frekvencie. Tu nastavíte vyššiu presnosť, rozsah frekvencií alebo výpočtovú náročnosť.

source: Settings
sk: Nastavenia

source: Scale name, only for your information.
sk: Názov stupnice, iba pre informáciu.

source: cents
sk: centov

source: Applies a shift in frequency to all the notes defined in the table below.
sk: Posunie frekvenciu všetkých tónov definovaných v tabuľke nižšie.

source: Deviation
sk: Odchýlka

source: Octave
sk: Oktáva

source: Octave whose frequencies are being displayed in the table below. Change this parameter if you want to display the assigned frequencies in other octaves, but try to assign the frequencies always to the 4th octave (The 4th octave usually covers the frequencies from 261.63 Hz to 523.25 Hz).
sk: Oktáva, ktorej frekvencie sú zobrazené v tabuľke nižšie. Zmeňte tento parameter, ak chcete zobraziť priradené frekvencie v iných oktávach, ale vždy sa snažte priradiť frekvencie ku 4. oktáve (4. oktáva zvyčajne pokrýva frekvencie od 261.63 Hz do 523.25 Hz).

source: Insert
sk: Vložiť

source: Adds a new note to the list, just above the selected line, or appends it to the end if no line is selected. Is not possible to add a note before the reference (the first) one. You can also use the Insert key on the table beside.
sk: Pridá nový tón do stupnice nad označený riadok alebo na koniec, ak nie je nič označené. Nedá sa pridať tón nad referenčný (prvý) tón. Pri úpravách tabuľky je tiež možné použiť kláves Insert.

source: Delete
sk: Odstrániť

source: Deletes the selected notes. The reference note, i.e., the first one, cannot be removed. You can also use the Delete key on the table beside.
sk: Odstráni vybrané tóny. Referenčný (prvý) tón sa nedá odstrániť. Pri úprave tabuľky je možne tiež použiť kláves Delete.

source: Import
sk: Importovať

source: Imports the scale from an external .scl file, with the Scala project format (http://www.huygens-fokker.org/scala/)
sk: Načíta stupnicu zo súboru s koncovkou .scl vo formáte projektu Scala (http://www.huygens-fokker.org/scala/).

source: Lingot is an universal tuner, it can tune any instrument according to the scale you define here.
sk: Lingot je univerzálna ladička, ktorá dokáže naladiť akýkoľvek nástroj podľa stupnice, ktorú tu môžte nadefinovať.

source: Scale
sk: Stupnica

source: Logo design
sk: Návrh loga

source: Accurate and easy to use musical instrument tuner
sk: Presná a ľahko použiteľná ladička hudobných nástrojov

source: translator-credits
sk: Jose Riha <jose1711@gmail.com>, 2020

source: Shows the error in cents in a visual way. The range will depend on the maximum distance between each two notes in the scale defined in the Lingot settings. Try to provide scales with low maximum distance, i.e. with enough notes, to have a higher resolution in this gauge (12 notes per scale is a safe option).
sk: Vizualizácia odchýlky v centoch. Rozsah závisí na najvyššom intervale medzi dvoma tónmi stupnice definovanom v nastavení Lingotu (definujte stupnice s malými intervalmi medzi dvoma susednými tónmi, teda s veľa tónmi, aby ste dosiahli vyššieho rozlíšenia mierky).

source: Shows the error as a rotating disc which speed depends on the error in cents to the desired note. The disc will be still then the played note is in tune.
sk: Zobrazovať chybu ako rotujúci disk, ktorého rýchlosť závisí na veľkosti odchýlky od požadovaného tónu (v centoch). Ak je daný tón naladený, disk sa zastaví.

source: Please check that there are not other processes locking the requested device. Also, consider that some audio servers can sometimes hold the resources for a few seconds since the last time they were used. In such a case, you can try again.
sk: Skontrolujte, prosím, či nebežia iné procesy, ktoré zamykajú požadované zariadenie. Tiež myslite na to, že niektoré zvukové servery môžu blokovať prostriedky aj niekoľko sekúnd po tom, ako boli naposledy použité. V takých prípadoch to skúste znovu.

source: The core is not running, you must check your configuration.
sk: Jadro nebeží, skontrolujte konfiguráciu.

source: Error
sk: Chyba

source: Warning
sk: Upozornenie

source: Info
sk: Informácia

source: Open Configuration File
sk: Načítať súbor s konfiguráciou

source: Lingot configuration files
sk: Konfiguračné súbory Lingot

source: Save Configuration File
sk: Uložiť konfiguračný súbor

source: untitled.conf
sk: bezmena.conf

source: Welcome to Lingot %s. We have added a new experimental strobe disc display, among other improvements, which you can find under the 'View' menu. Enjoy!
sk: Víta vás Lingot %s. Medzi inými vylepšeniami sme pridali experimentálne zobrazenie rotujúceho disku pri ladení, ktorý nájdete v ponuke 'Zobraziť'. Dúfam, že sa vám program bude páčiť.

source: _File
sk: _Súbor

source: Opens an external configuration file.
sk: Načíta externý súbor s konfiguráciou.

source: Saves the running configuration to an external file.
sk: Uloží aktuálnu konfiguráciu do externého súboru.

source: _Edit
sk: Úp_ravy

source: _View
sk: _Zobrazenie

source: Show gauge
sk: Zobraziť mierku

source: Show strobe disc
sk: Zobraziť rotujúci disk

source: Show spectrum
sk: Zobrazit spektrum

source: _Help
sk: _Pomocník

source: Estimated ground frequency in hertzs.
sk: Zistená základná frekvencia v Hertzoch.

source: Closest note to the estimated frequency, according to the scale defined in the Lingot settings.
sk: Najbližší tón k zistenej frekvencií, podľa stupnice definovanej v nastaveniach Lingotu.

source: Error in cents between the estimated frequency and the closest note according to the scale defined in the Lingot settings.
sk: Rozdiel v centoch mezi zistenou frekvenciou a najbližším zodpovedajúcim tónom podľa stupnice definovanej v nastaveniach Lingotu.

source: Tone
sk: Tón

source: This area shows the signal-to-noise ratio (SNR) of the captured signal. The ground frequency computed is shown with a red vertical line, the target frequency as a vertical blue line, and the noise threshold with a horizontal dotted yellow line.
sk: Táto oblasť zobrazuje odstup signálu a šumu (SNR) snímaného signálu. Vypočítaná základná frekvencia je znázornená zvislou červenou čiarou, cieľová frekvencia je znázornená zvislou modrou čiarou a prah šumu prerušovanou žltou čiarou.

source: Spectrum
sk: Spektrum

source: incorrect format
sk: nesprávny formát

source: note number mismatch
sk: počet tónov nesúhlasí

source: Error opening scale file
sk: Chyba pri otváraní súboru so stupnicou

source: the notes must be well ordered
sk: tóny musia byť usporiadané vzostupne

source: Error parsing the configuration file, line %i: unrecognized audio system, assuming default value.
sk: Chyba pri čítaní súboru s konfiguráciou, riadok %i: nerozpoznaný zvukový systém, použijem predvolenú hodnotu.

source: The configuration file contains errors, and hence some default values have been chosen. The problem will be fixed once you have accepted the settings in the configuration dialog.
sk: Súbor s konfiguráciou obsahuje chyby a preto boli niekde použité predvolené hodnoty. Problém opravíte, ak prijmete tieto nastavenia v dialógovom okne nastavení.

source: Error parsing the configuration file, unrecognized audio system '%s', assuming default value.
sk: Chyba pri čítaní súboru s konfiguráciou, nerozpoznaný zvukový systém '%s', použijem predvolenú hodnotu.
